{"keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "arguments": {}, "input_dtype": "float32", "output_shape": null, "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 40, 80, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001a\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_1", "nb_row": 8, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "bias": true, "border_mode": "same", "trainable": true, "activation": "linear", "nb_col": 8, "b_regularizer": null, "b_constraint": null, "nb_filter": 16, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_2", "nb_row": 5, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "bias": true, "border_mode": "same", "trainable": true, "activation": "linear", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "nb_filter": 32, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_3", "nb_row": 5, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "bias": true, "border_mode": "same", "trainable": true, "activation": "linear", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "nb_filter": 64, "W_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_1", "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 512, "b_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_2", "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 1, "b_regularizer": null, "b_constraint": null, "trainable": true}}], "class_name": "Sequential"}
